book_type_data = [
    {
        'sub_books': [
            {
                'title': '小学'
            },
            {
                'title': '易类'
            },
            {
                'title': '诗类'
            },
            {
                'title': '书类'
            },
            {
                'title': '礼类'
            },
            {
                'title': '春秋'
            },
            {
                'title': '孝经'
            },
            {
                'title': '石经'
            },
            {
                'title': '五经'
            },
            {
                'title': '四书'
            },
            {
                'title': '乐类'
            },
        ],
        'title': '经学经事'
    },
    {
        'sub_books': [
            {
                'title': '正史'
            },
            {
                'title': '编年'
            },
            {
                'title': '杂史'
            },
            {
                'title': '别史'
            },
            {
                'title': '传记'
            },
            {
                'title': '载记'
            },
            {
                'title': '地理'
            },
            {
                'title': '职官'
            },
            {
                'title': '政书'
            },
            {
                'title': '四书'
            },
            {
                'title': '乐类'
            },

        ],
        'title': '史学实录'
    },
    {
        'sub_books': [
            {
                'title': '儒家'
            },
            {
                'title': '道家'
            },
            {
                'title': '法家'
            },
            {
                'title': '医家'
            },
            {
                'title': '兵家'
            },
            {
                'title': '农家'
            },
        ],
        'title': '子学道统'
    },
    {
        'sub_books': [
            {
                'title': '楚辞'
            },
            {
                'title': '别集'
            },
            {
                'title': '总集'
            },
            {
                'title': '词曲'
            },
            {
                'title': '元曲'
            },
        ],
        'title': '文学总集'
    },
]


#!/usr/bin/env python
# encoding: utf-8

book_auth_data = [
    {
		"name":'刘养锋',
		"introduce_link": '刘养锋',
		"introduces": '刘养锋（1894—1960）名葆锷，养锋为其字，西峰区显胜乡下刘村人。出身耕读世家，赋性聪颖，敏而好学，博闻强记。',
		"avatar_link": '01_avatar.jpg',
    },
	{
		"name":'周兴嗣',
		"introduce_link": '周兴嗣',
		"introduces": '周兴嗣，生于黄帝三一六六年，卒于黄帝三二三四年（梁武帝大同三年七月十五日），字思纂，祖上是陈郡项（今河南省沈丘县）人，先人在西晋永嘉时南迁，後世居姑孰（今安徽省当涂县），是南朝梁朝史学家，政治家。 周兴嗣自幼博学，善于属文。梁武帝时官拜安成王国侍郎，仕至给事中。兴嗣受梁武帝之命，将书圣王羲之的墨迹，一千个零散字组合成文章（其时，不押韵的文字称为笔迹，欲称为文，则必须押韵），得《千字文》。 另外，周兴嗣还撰写了《皇帝实录》《职仪》《起居注》《皇德记》等专著百余卷，文集十卷传世。',
		"avatar_link": '02_avatar.jpg',
    },
	{
		"name":'车万育',
		"introduce_link": '车万育',
		"introduces": '车万育（生耶元一六三二 ~ 卒耶元一七零五），邵阳县人。幼年家境贫寒，车万育父亲迷信风水，一天，请了一阴阳先生来选择墓地，阴阳先生指着某地说：“此地甚佳，但需五百年后始可发迹。”当时车万育年幼，随在父侧，插嘴说道：“那就把五百年前的祖宗，改葬到这里来，不就发迹了么？”阴阳先生见其聪慧，说道“此子日后，必定发迹。”此后，车万育发奋攻读，参加科考，一帆风顺，由秀才而举人，康熙三年（耶元一六六五）中了进士，接着授户部给事中，后升掌印。车万育授户部给事中，常直言面对皇上，专拣当务之急，他人咋舌难言之事上奏，同僚为他担心，他说：“进言是我职责，竭尽忠诚...',
		"avatar_link": '03_avatar.jpg',
    },
	{
		"name":'司守谦',
		"introduce_link": '司守谦',
		"introduces": '司守谦，字益甫，明代宣化里人。能文，不幸早夭，诗文散佚，仅《训蒙骈句》存世。',
		"avatar_link": '03_avatar.jpg',
    },
	{
		"name":'朱用纯',
		"introduce_link": '朱用纯',
		"introduces": '朱柏廬（1617—1688），名用純，字致一，自號柏廬(昆山現有柏廬小學)，江蘇省昆山縣人，明末清初生員出身，生於明萬歷四十五年。其父朱集璜是明末的學者。清入關後不久，其隱居不士，居鄉教授學生。朱柏廬學尊程朱理學，頗有建樹。主張知行並進，其著作有《刪補易經蒙引》、《四書講義》、《綴講語》、《愧訥集》、和《大學中庸講義》、《勸言》和《朱子家訓》等。其中尤以506字的《朱子家訓》最有影響。從清代以來，似乎沒有任何一本家訓的流傳和影響能與它相比，它自問世三百年來，膾炙人口，簡直到了家喻戶曉的地步。',
		"avatar_link": '03_avatar.jpg',
    },
	{
		"name":'揚雄',
		"introduce_link": '揚雄',
		"introduces": '揚雄字子雲，漢族。西漢官吏、學者。西漢蜀郡成都（今四川成都郫都區）人。 揚雄少年好學，口吃，博覽群書，長於辭賦。年四十余，始游京師長安，以文見召，奏《甘泉》、《河東》等賦。成帝時任給事黃門郎。王莽時任大夫，校書天祿閣。揚雄是繼司馬相如之後西漢最著名的辭賦家。所謂“歇馬獨來尋故事，文章兩漢愧楊雄”。在劉禹錫著名的《陋室銘》中“西蜀子雲亭”的西蜀子雲即為揚雄。 揚雄曾撰《太玄》等，將源於老子之道的玄作為最高範疇，並在構築宇宙生成圖式、探索事物發展規律時，以玄為中心思想，是漢朝道家思想的繼承和發展者， 對後世意義可謂重大。',
		"avatar_link": '03_avatar.jpg',
    },
	{
		"name":'曾仕强',
		"introduce_link": '曾仕强',
		"introduces": '曾仕强（1934年8月28日-2018年11月11日），国学大师、中国式管理大师，全球华人中国式管理第一人，被称为“中国式管理之父” [1] ，曾任台湾智慧大学校长，台湾交通大学教授，台湾兴国管理学院校长。 英国牛津大学管理哲学荣誉博士、英国莱斯特大学管理哲学博士、美国杜鲁门大学行政管理硕士、国立台湾师范大学教育学学士；著有《胡雪岩的启示》、《易经的奥秘》、《中国式管理》、《家庭教育》、《孙子兵法与人力自动化》等，而最让大家熟悉的是他在《百家讲坛》中的演讲。 [2] 2010年11月15日，“2010第五届中国作家富豪榜”重磅发布，曾仕强以780万元的版税收入，荣登作家富豪榜第5名。',
		"avatar_link": '03_avatar.jpg',
    },
	{
		"name":'孔子后学',
		"introduce_link": '孔子后学',
		"introduces": '',
		"avatar_link": '03_avatar.jpg',
    },
	{
		"name":'韦曜',
		"introduce_link": '韦曜',
		"introduces": '韦曜，本名韦昭，字弘嗣，吴郡云阳（今江苏丹阳）人。三国时期著名史学家、东吴四朝重臣。韦曜是中国古代史上从事史书编纂时间最长的史学家，后世《三国志》多取材其《吴书》。少时好学能文。早年曾任丞相掾、西安令、尚书郎、太子中庶子、黄门侍郎、太史令、中书郎等职。258年，孙休废孙亮，立为皇帝，改元永安，昭立五经博士而创设国学，立太学博士制度，韦昭官拜中书郎，出任博士祭酒，掌管国子学。264年，孙休去世，孙皓即位，韦昭封高陵亭侯，担任中书仆射、侍中，领左国史。后为孙皓所害，时年七十岁。著有《吴书》（合著）、《汉书音义》、《国语注》、《官职训》等。',
		"avatar_link": '03_avatar.jpg',
    },
	{
		"name":'尹吉甫采集',
		"introduce_link": '尹吉甫采集',
		"introduces": '【诗经】的作者佚名，绝大部分已经无法考证，传为尹吉甫采集、孔子编订。 相传周代设有采诗之官，每年春天，摇着 木铎深入民间收集民间歌谣，把能够反映人民欢乐疾苦的作品，整理后交给太师（负责音乐之官）谱曲，演唱给周天子听，作为施政的参考。这些没有记录姓名的民间作者的作品，占据诗经的多数部分，如十五国风。 周代贵族文人的作品构成了诗经的另一部分。【尚书】记载，【豳风·鸱鸮】为周公旦所作。',
		"avatar_link": '03_avatar.jpg',
    },
	{
		"name":'徐俊生',
		"introduce_link": '徐俊生',
		"introduces": '徐俊生，字彥卿。民間儒學者。大學理工科畢業。少年喜讀歷史、唐詩宋詞。從事讀經教育工作多年，熟讀儒家、道家等傳統經典、諸子書籍等。並研習傳統禮儀，著有《華夏禮義》一書。 長期策劃、主持國內各地祭孔釋奠大典、祭祖儀式、傳統漢式婚禮、冠禮等禮儀活動。 曾應邀參加央視《開心學國學》、深圳衛視《印象端午》等媒體活動。曾應邀參加第三屆、第四屆北戴河國學論壇。 電視劇《將軍在上》禮儀指導。擅長傳統禮儀主持、講解，儒學經典講解，中國古代史等。 治學思想：以理為基，以儒為本。以史為鑒，以時為用。',
		"avatar_link": '03_avatar.jpg',
    },
	{
		"name":'左丘明',
		"introduce_link": '左丘明',
		"introduces": '左丘明，别名鲁君子，姜姓丘氏（一说左丘为复姓），名明。本名丘明，因其先祖曾任楚国的左史官，故在姓前添『左』字，故称左史丘明先生，世称『左丘明』，中国春秋时史学家。 左丘明籍贯，一说为春秋时鲁国之附庸小邾国人（今山东省山亭区抱犊崮一带），一说为春秋末年鲁国都君庄（今山东省肥城市石横镇东衡鱼村）人。 春秋时有称为瞽的盲史官，记诵、讲述有关古代历史和传说，口耳相传，以补充和丰富文字的记载，左丘明即为瞽之一。左氏世为鲁国太史，至丘明则约与孔子同时，而年辈稍晚。相传曾著【左传】和【国语】，作【国语】时已双目失明，两书记录了不少西周、春秋的重要史事。',
		"avatar_link": '03_avatar.jpg',
    },
	{
		"name":'李隆基,邢昺',
		"introduce_link": '',
		"introduces": '【邢昺】 邢昺(黄帝3629年-3707年)，字叔明，北宋曹州济阴郡(今山东曹县北)人。 邢昺是北宋初年经学家、训诂学家。擢九经及第，历任国子博士、国子祭酒、礼部尚书等。为《论语》所疏的《论语注疏》（何晏注），主论心性命理，为后来理学家所宗。为《尔雅》作疏的《尔雅注疏》(郭璞注)，及为《孝经》作疏的《孝经注疏》(李隆基注)，均为《十三经注疏》收录为定位。 在思想史学界，邢昺被认定为，是宋代以义理说经的第一人，是宋代新儒学先行者，在儒家学术的理学化演变过程中，有着奠基者的地位。 【李隆基】 唐玄宗李隆基(黄帝3382年八月戊寅-3459年四月五日)，年号分别为先天、开元、天...',
		"avatar_link": '03_avatar.jpg',
    },
	{
		"name":'朱熹',
		"introduce_link": '朱熹',
		"introduces": '朱熹，字元晦，又字仲晦，号晦庵，晚称晦翁，谥文，世称朱文公。祖籍江南东路徽州府婺源县(今江西省婺源)，出生于南剑州尤溪(今属福建省尤溪县)。宋朝著名的理学家、思想家、哲学家、教育家、诗人，闽学派的代表人物，儒学集大成者，世尊称为朱子。朱熹是唯一非孔子亲传弟子而享祀孔庙，位列大成殿十二哲者中。 朱熹是程颢、程颐的三传弟子李侗的学生，任江西南康、福建漳州知府、浙东巡抚，做官清正有为，振举书院建设。官拜焕章阁侍制兼侍讲，为宋宁宗皇帝讲学。 朱熹著述甚多，有《四书章句集注》《太极图说解》《通书解说》《周易读本》《楚辞集注》，后人辑有《朱子大全》等。',
		"avatar_link": '03_avatar.jpg',
    },
	{
		"name":'郑玄,贾公彦',
		"introduce_link": '郑玄,贾公彦',
		"introduces": '【周礼】周公旦 周公旦，西周政治家。周公姓姬，名旦。周武王之弟，亦称叔旦。周文王的第四子周武王的同母弟。因采邑在周，称为周公。武王死后，其子成王年幼，由他摄政当国。武王死后又平定『三监』叛乱，大行封建，营建东都，制礼作乐，还政成王，在巩固和发展周王朝的统治上起了关键性的作用，对中国历史的发展产生了深远影响。周公在当时不仅是卓越的政治家、军事家，而且还是个多才多艺的诗人、学者。其兄弟管叔、蔡叔和霍叔等人勾结商纣子武庚和徐、奄等东方夷族反叛。他奉命出师，三年后平叛，并将国家势力扩展至东海。后建成周洛邑，作为东都。相传他制礼作乐，建立典章制度。',
		"avatar_link": '03_avatar.jpg',
    },
	{
		"name":'房玄龄等廿一人',
		"introduce_link": '房玄龄等廿一人',
		"introduces": '《晋书》作者共二十一人。 监修三人：房玄龄、褚遂良、许敬宗 天文、律历、五行等三志的作者：李淳风 拟订修史体例：敬播（注：没有流传下来。） 其他十六人：令狐德棻、来济、陆元仕、刘子翼、卢承基、李义府、薛元超、上官仪、崔行功、辛丘驭、刘胤之、杨仁卿、李延寿、张文恭、李安期和李怀俨。 另外唐太宗李世民也在宣帝（司马懿）、武帝（司马炎）二纪及陆机、王羲之两传写了四篇史论，所以有题“御撰”。',
		"avatar_link": '03_avatar.jpg',
    },
	{
		"name":'贺惟一等',
		"introduce_link": '',
		"introduces": '西元一三四三年，由伪元丞相脱脱和阿鲁图先后主持修撰。是中国二十四史中最庞大的一部史书。 华韵注：为方便阅读及检索，本站将所收录的宋史，特归类为四辑，分别为第一辑本紀，共贰卷；第二辑志，共陆卷；第三辑表，共壹卷；第四辑列传，共柒卷。',
		"avatar_link": '03_avatar.jpg',
    },
	{
		"name":'王国维',
		"introduce_link": '王国维',
		"introduces": '王国维（清末民初），曾名国桢，字静安，亦字伯隅，初号礼堂，晚号观堂，又号永观，谥忠悫。汉族，浙江省海宁人。王国维是中国近、现代相交时期一位享有国际声誉的著名学者。 王国维早年追求新学，接受资产阶级改良主义思想的影响，把西方哲学、美学思想与中国古典哲学、美学相融合，研究哲学与美学，形成了独特的美学思想体系，继而攻词曲戏剧，后又治史学、古文字学、考古学。郭沫若称他为新史学的开山，不止如此，他平生学无专师，自辟户牖，成就卓越，贡献突出，在教育、哲学、文学、戏曲、美学、史学、古文学等方面均有深诣和创新，为中华民族文化宝库留下了广博精深的学术遗产。',
		"avatar_link": '03_avatar.jpg',
    },
	{
		"name":'漢川草廬校',
		"introduce_link": '漢川草廬校',
		"introduces": '西晋武帝命令中书监荀勖、中书令和峤负责解译竹简，秘书丞卫恒「考正」，佐著作郎束晳续，其他史官整理命名该史书。 汉川草庐初校。汉川草庐是一个由『喜欢文史哲，住在台湾的中国人』搭建的网站.',
		"avatar_link": '03_avatar.jpg',
    },
	{
		"name":'叶向高等',
		"introduce_link": '叶向高等',
		"introduces": '大明光宗贞皇帝实录是由叶向高等人编篡的一部传记类史书。',
		"avatar_link": '03_avatar.jpg',
    },
	{
		"name":'易其霈',
		"introduce_link": '易其霈',
		"introduces": '易其霈，广东新会人，易氏入粤廿一世孙。',
		"avatar_link": '03_avatar.jpg',
    },
	{
		"name":'王弼',
		"introduce_link": '王弼',
		"introduces": '王弼，字辅嗣，魏国山阳（应为今山东金乡）人。三国魏玄学家，历代学者以王弼注本较近老子原意。 据经籍记载，其著作主要有【老子注】，【老子指略】，【论语释疑】，【周易注】，【周易指略】，【周易大衍论】，【周易穷微论】，【易辨】，【易传纂图】，【王弼集】等。',
		"avatar_link": '03_avatar.jpg',
    },
	{
		"name":'郭庆藩',
		"introduce_link": '郭庆藩',
		"introduces": '清末郭庆藩，他的【庄子集释】是替【庄子】注解作总结之作。【集释】收录了郭象【注】、成玄英【疏】和陆德明【音义】三书的全文，摘引了清代汉学家如王念孙、俞樾等人的训诂考证，卢文弨的校勘，并有郭嵩焘和郭庆藩自己的意见，是目前研究【庄子】的重要资料。',
		"avatar_link": '03_avatar.jpg',
    },
	{
		"name":'懋基',
		"introduce_link": '懋基',
		"introduces": '延章原名易懋基，字秀忠，號沙坡先生。 華韻國學系列網站創始人。',
		"avatar_link": '03_avatar.jpg',
    },
	{
		"name":'忽思慧',
		"introduce_link": '忽思慧',
		"introduces": '忽思慧，又音译和斯辉。回回。元蒙殖民时代著名的营养学家，他写的【饮膳正要】一书，是我国史上甚至是世界史上最早的饮食卫生与营养学专著，对传播和发展我国卫生保健知识，起到了重要作用。 据【新元史·常齩住传】，常普兰奚于延祐二年（西元1315）加金紫光禄大夫、徽政院使，掌侍奉皇太后诸事，忽思慧很可能即于是年被选任饮膳太医，入侍元仁宗之母兴圣太后答己。',
		"avatar_link": '03_avatar.jpg',
    },{
		"name":'王雪华',
		"introduce_link": '王雪华',
		"introduces": '王雪华教授，女，现任黑龙江中医药大学中医临床基础学科金匮教研室主任，研究生导师，基础医学院学术、学位分委员会委员，教学督导专家组成员；曾任中国中医药学会仲景学说专业委员会委员，黑龙江省科委、省医药管理局、哈尔滨市卫生局科技成果（立项）评审委员会专家组成员等职，现受聘美国中国医学研究院特约研究员等。',
		"avatar_link": '03_avatar.jpg',
    },
	{
		"name":'宋应星',
		"introduce_link": '宋应星',
		"introduces": '宋应星，字长庚，汉族，江西奉新人，中国明末清初著名的科学家。 宋应星一生致力于对农业和手工业生产的科学考察和研究，收集了丰富的科学资料;同时思想上的超前意识使他成为对封建主义和中世纪学术传统持批判态度的思想家。',
		"avatar_link": '03_avatar.jpg',
    },
	{
		"name":'佚名',
		"introduce_link": '佚名',
		"introduces": '佚名。素有争论。',
		"avatar_link": '03_avatar.jpg',
    },{
		"name":'王羲之,房弘毅',
		"introduce_link": '王羲之,房弘毅',
		"introduces": '王羲之，字逸少，汉族，东晋时期著名书法家，有『书圣』之称。琅琊临沂（今山东临沂）人，后迁会稽山阴（今浙江绍兴），晚年隐居剡县金庭。历任秘书郞、宁远将军、江州刺史，后为会稽内史，领右将军。其书法兼善隶、草、楷、行各体，精研体势，心摹手追，广采众长，备精诸体，冶于一炉，摆脱了汉魏笔风，自成一家，影响深远。',
		"avatar_link": '03_avatar.jpg',
    },{
		"name":'张岱',
		"introduce_link": '张岱',
		"introduces": '张岱(黄帝4295年-4378年 )，名岱，又名维城，字宗子，又字石公，号陶庵、天孙，又号蝶庵居士，晚年更号六休居士。 明朝史学家、诗人，山阴(今浙江绍兴)人。崇尚老庄之道，工于诗词，精于小品文，更善于茶艺鉴赏。不事科举，不求仕进，著述终老。【石匮书】是其史学名著，时人李长祥喻为『当今史学，无逾陶庵』。 ',
		"avatar_link": '03_avatar.jpg',
    },
	{
		"name":'李清照',
		"introduce_link": '李清照',
		"introduces": '李清照（1084—1155），号易安居士，宋代女词人，婉约词派代表人物，古称“千古第一才女”，齐州章丘（今山东济南章丘区）人。 李清照出生于书香门第，青年时期生活优裕，父亲李格非藏书甚富，是当时著名学者，良好的家庭环境为其文学成就打造了基础。 李清照丈夫赵明诚是金石玩家，早期与明诚共同搜集整理书画金石。',
		"avatar_link": '03_avatar.jpg',
    },
	{
		"name":'朱之瑜',
		"introduce_link": '朱之瑜',
		"introduces": '朱舜水，本名朱之瑜．诞万历二十八年十月十二日．又公元一六００年十一月十七日．卒永历三十六年．又公元一六八二年五月廿三日．字楚屿．又作鲁屿．号舜水．浙江余姚人．明末贡生．学者和教育家．因在明末和南明曾二次奉诏特征．未就．人称征君． 满清入关后，流亡在东南亚积极推动抗清复明，并立为终生之志，至死不忘。',
		"avatar_link": '03_avatar.jpg',
    },
	{
		"name":'吕尚',
		"introduce_link": '吕尚',
		"introduces": '吕尚，殷商末年东海上人。周文王拜吕尚为师。周文王曾对姜尚说：“自吾先君太公曰‘当有圣人适周，周以兴’。子真是邪?吾太公望子久矣”。故后人尊称吕尚为齐太公、太公望。周文王死后，周武王仍以吕尚为师，在耶元前1046年率兵大败商军于牧野。《诗经‧大雅‧大明》中赞此事：“牧野洋洋，檀车煌煌，驷騵彭彭。维师尚父，时维鹰扬。',
		"avatar_link": '03_avatar.jpg',
    },
	{
		"name":'王弼',
		"introduce_link": '王弼',
		"introduces": '',
		"avatar_link": '03_avatar.jpg',
    },
	{
		"name":'王弼',
		"introduce_link": '王弼',
		"introduces": '',
		"avatar_link": '03_avatar.jpg',
    },
]